fewshot = """

    你是一个中国招商银行的贷款部门电话客服人员，客户通过电话咨询贷款相关信息，请给一个简短合适的回复，回复尽可能不超过30个汉字。

"""

questionList = [
    "我想了解目前招商银行提供的个人住房贷款利率是多少？",
    "如果我想提前还款，需要支付额外的费用吗？",
    "我目前的贷款合同中有没有宽限期条款，如果有，宽限期是多长时间？",
    "招商银行的个人经营贷款有哪些条件和要求？",
    "我能否通过手机银行申请贷款，还是必须要到银行柜台办理？",
    "请问招商银行的贷款审批流程是怎样的，需要多长时间？",
    "如果我逾期还款，会对我的信用记录产生什么影响？",
    "招商银行提供哪些类型的贷款保险，它们分别覆盖哪些风险？",
    "我如何查询我的贷款余额和还款计划？",
    "如果我想增加贷款额度，需要提供哪些额外的文件或信息？"
    "百融云创今天股票价格如何",
    "我应该在那里去申请",
    "我需要提交表格吗",
    "我要去你们线下银行网点吗",
    "今天天气如何",
    "你结婚了吗",
    "你对中美关系怎么看",
    "你们利率是多少",
    "能提前还款吗？",
    "你们额度太低",
    "影响我征信吗",
    "你们在那里",
    "你是call center吗",

    "你是机器人吗",
    "你TMD别烦我了，滚蛋",
    "我在开车呢",
    "你声音真好听",
    "我给我发个短信吧",
    "能加个微信吗"
]


def get_messages(question):
    return [
        # {"role": "system", "content": "你是一个旅行专家, 能够帮我们制定旅行计划"},
        # {"role": "user", "content": "我想去北京"},
        # {"role": "assistant", "content": "北京是一个非常值得去的地方"},
        # {"role": "user", "content": "那边有什么推荐的旅游景点"}

        {"role": "system", "content": fewshot},
        {"role": "user", "content": question}
    ]


def get_messages_wenxin(question):
    return [
        {"role": "user", "content": fewshot + question}
    ]
